package com.allclearwas.domains.course.type;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

@Getter
@RequiredArgsConstructor
public enum Location {
	E21_106("E21-106호"),
	E21_109("E21-109호"),
	E21_111("E21-111호"),
	E21_112("E21-112호"),
	E21_113("E21-113호"),
	E21_114("E21-114호"),
	E21_115("E21-115호"),
	E21_116("E21-116호"),
	E21_117("E21-117호"),
	E21_118("E21-118호"),
	E21_123("E21-123호"),
	E21_124("E21-124호"),
	E21_214("E21-214호"),
	E21_219("E21-219호"),
	E21_220("E21-220호"),
	E21_221("E21-221호"),
	E21_322("E21-322호"),
	E21_323("E21-323호"),
	E21_319("E21-319호"),

	F04_104("F04-104호"),
	F04_205("F04-205호"),

	B02_152("B02-152호"),
	B02_257("B02-257호"),

	C02_316("C02-316호"),
	C02_317("C02-317호"),
	C02_318("C02-318호"),
	C02_320("C02-320호"),
	C02_321("C02-321호"),
	C02_323("C02-323호"),

	E29_254("E29-254호");


	private final String name;
}
